benchmarks/risingBubble/N640/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.phase1 1
);

regions
(
    // Bubble
    cylinderToCell
    {
        p1 (0 0.5 -0.05);
        p2 (0 0.5  0.05); 
        radius 0.25;
        fieldValues
        (
            volScalarFieldValue alpha.phase1 0
        );
    }
);


// ************************************************************************* //
